---
kind: property
id: P:Autodesk.Revit.DB.ExternalFileReference.PathType
source: html/ce50827b-3c3b-ca1c-141a-b488472a1817.htm
---
# Autodesk.Revit.DB.ExternalFileReference.PathType Property

The path type of the link (relative, absolute, or server).

## Syntax (C#)
```csharp
public PathType PathType { get; }
```